Revit 2027 API
FabricationServiceButton.ServiceId Property
 The fabrication service identifier for the fabrication service this button belongs to.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int ServiceId { get; }
Public ReadOnly Property ServiceId As Integer
	Get
public:
property int ServiceId {
	int get ();
}
member ServiceId : int with get
Property Value
Int32
See Also
Reference
FabricationServiceButton Class
Autodesk.Revit.DB Namespace